Create Pandas Series

In [1]:
#pip install pandas

In [2]:
import pandas as pd

In [3]:
a=pd.Series([1,2,3,4,5])

In [4]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
a[2]

3

In [6]:
type(a)

pandas.core.series.Series

In [7]:
b=pd.Series(['a','b','c'])

In [8]:
b

0    a
1    b
2    c
dtype: object

In [9]:
c=pd.date_range(start='01-01-2018', end='23-5-2018')

In [10]:
c

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08',
               '2018-01-09', '2018-01-10',
               ...
               '2018-05-14', '2018-05-15', '2018-05-16', '2018-05-17',
               '2018-05-18', '2018-05-19', '2018-05-20', '2018-05-21',
               '2018-05-22', '2018-05-23'],
              dtype='datetime64[ns]', length=143, freq='D')

In [11]:
type(c)

pandas.core.indexes.datetimes.DatetimeIndex

Pandas Dataframe

In [12]:
import numpy as np

In [13]:
temp=np.random.randint(low=20,high=100,size=[20,])
name=np.random.choice(['Abhay','Teclov',"Geekshub",'Ankit'],20)
random=np.random.choice([10,11,13,12,14],20)

In [14]:
a=list(zip(temp,name,random))

In [15]:
a

[(51, 'Teclov', 14),
 (97, 'Abhay', 11),
 (80, 'Ankit', 13),
 (89, 'Geekshub', 12),
 (33, 'Teclov', 14),
 (37, 'Geekshub', 13),
 (42, 'Geekshub', 11),
 (76, 'Ankit', 11),
 (61, 'Geekshub', 13),
 (64, 'Abhay', 10),
 (95, 'Teclov', 10),
 (35, 'Teclov', 13),
 (85, 'Geekshub', 14),
 (59, 'Geekshub', 12),
 (39, 'Teclov', 11),
 (71, 'Geekshub', 12),
 (63, 'Ankit', 10),
 (27, 'Abhay', 12),
 (65, 'Abhay', 10),
 (86, 'Abhay', 10)]

In [16]:
df=pd.DataFrame(data=a,columns=['temp','name','random'])

In [17]:
df

    temp      name  random
0     51    Teclov      14
1     97     Abhay      11
2     80     Ankit      13
3     89  Geekshub      12
4     33    Teclov      14
5     37  Geekshub      13
6     42  Geekshub      11
7     76     Ankit      11
8     61  Geekshub      13
9     64     Abhay      10
10    95    Teclov      10
11    35    Teclov      13
12    85  Geekshub      14
13    59  Geekshub      12
14    39    Teclov      11
15    71  Geekshub      12
16    63     Ankit      10
17    27     Abhay      12
18    65     Abhay      10
19    86     Abhay      10

In [18]:
type(df)

pandas.core.frame.DataFrame

Create data frame using dictionary

In [19]:
df=pd.DataFrame({'temp':temp,'name':name,'random':random})

In [20]:
df

    temp      name  random
0     51    Teclov      14
1     97     Abhay      11
2     80     Ankit      13
3     89  Geekshub      12
4     33    Teclov      14
5     37  Geekshub      13
6     42  Geekshub      11
7     76     Ankit      11
8     61  Geekshub      13
9     64     Abhay      10
10    95    Teclov      10
11    35    Teclov      13
12    85  Geekshub      14
13    59  Geekshub      12
14    39    Teclov      11
15    71  Geekshub      12
16    63     Ankit      10
17    27     Abhay      12
18    65     Abhay      10
19    86     Abhay      10

using head method in dataframe

In [21]:
df.head()

   temp      name  random
0    51    Teclov      14
1    97     Abhay      11
2    80     Ankit      13
3    89  Geekshub      12
4    33    Teclov      14

using tail method in data frame

In [22]:
df.tail()

    temp      name  random
15    71  Geekshub      12
16    63     Ankit      10
17    27     Abhay      12
18    65     Abhay      10
19    86     Abhay      10

check dimension dataframe using in shape method

In [23]:
df.shape

(20, 3)

check columns of  dataframe

In [24]:
df.columns

Index(['temp', 'name', 'random'], dtype='object')

show name of dataframe

In [25]:
df.name

0       Teclov
1        Abhay
2        Ankit
3     Geekshub
4       Teclov
5     Geekshub
6     Geekshub
7        Ankit
8     Geekshub
9        Abhay
10      Teclov
11      Teclov
12    Geekshub
13    Geekshub
14      Teclov
15    Geekshub
16       Ankit
17       Abhay
18       Abhay
19       Abhay
Name: name, dtype: object

In [26]:
df['name']

0       Teclov
1        Abhay
2        Ankit
3     Geekshub
4       Teclov
5     Geekshub
6     Geekshub
7        Ankit
8     Geekshub
9        Abhay
10      Teclov
11      Teclov
12    Geekshub
13    Geekshub
14      Teclov
15    Geekshub
16       Ankit
17       Abhay
18       Abhay
19       Abhay
Name: name, dtype: object

In [27]:
df['temp'].describe()

count    20.000000
mean     62.750000
std      22.042722
min      27.000000
25%      41.250000
50%      63.500000
75%      81.250000
max      97.000000
Name: temp, dtype: float64

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   temp    20 non-null     int32
 1   name    20 non-null     object
 2   random  20 non-null     int32
dtypes: int32(2), object(1)
memory usage: 448.0+ bytes

In [29]:
df.values

array([[51, 'Teclov', 14],
       [97, 'Abhay', 11],
       [80, 'Ankit', 13],
       [89, 'Geekshub', 12],
       [33, 'Teclov', 14],
       [37, 'Geekshub', 13],
       [42, 'Geekshub', 11],
       [76, 'Ankit', 11],
       [61, 'Geekshub', 13],
       [64, 'Abhay', 10],
       [95, 'Teclov', 10],
       [35, 'Teclov', 13],
       [85, 'Geekshub', 14],
       [59, 'Geekshub', 12],
       [39, 'Teclov', 11],
       [71, 'Geekshub', 12],
       [63, 'Ankit', 10],
       [27, 'Abhay', 12],
       [65, 'Abhay', 10],
       [86, 'Abhay', 10]], dtype=object)

In [30]:
df

    temp      name  random
0     51    Teclov      14
1     97     Abhay      11
2     80     Ankit      13
3     89  Geekshub      12
4     33    Teclov      14
5     37  Geekshub      13
6     42  Geekshub      11
7     76     Ankit      11
8     61  Geekshub      13
9     64     Abhay      10
10    95    Teclov      10
11    35    Teclov      13
12    85  Geekshub      14
13    59  Geekshub      12
14    39    Teclov      11
15    71  Geekshub      12
16    63     Ankit      10
17    27     Abhay      12
18    65     Abhay      10
19    86     Abhay      10

Indexes

indexes is temprary

In [31]:
df.set_index('temp')

          name  random
temp
51      Teclov      14
97       Abhay      11
80       Ankit      13
89    Geekshub      12
33      Teclov      14
37    Geekshub      13
42    Geekshub      11
76       Ankit      11
61    Geekshub      13
64       Abhay      10
95      Teclov      10
35      Teclov      13
85    Geekshub      14
59    Geekshub      12
39      Teclov      11
71    Geekshub      12
63       Ankit      10
27       Abhay      12
65       Abhay      10
86       Abhay      10

indexes permanently

In [33]:
df.set_index('temp',inplace=True)

In [34]:
df

          name  random
temp
51      Teclov      14
97       Abhay      11
80       Ankit      13
89    Geekshub      12
33      Teclov      14
37    Geekshub      13
42    Geekshub      11
76       Ankit      11
61    Geekshub      13
64       Abhay      10
95      Teclov      10
35      Teclov      13
85    Geekshub      14
59    Geekshub      12
39      Teclov      11
71    Geekshub      12
63       Ankit      10
27       Abhay      12
65       Abhay      10
86       Abhay      10

desc order

In [35]:
df.sort_index(axis=0,ascending=False)

          name  random
temp
97       Abhay      11
95      Teclov      10
89    Geekshub      12
86       Abhay      10
85    Geekshub      14
80       Ankit      13
76       Ankit      11
71    Geekshub      12
65       Abhay      10
64       Abhay      10
63       Ankit      10
61    Geekshub      13
59    Geekshub      12
51      Teclov      14
42    Geekshub      11
39      Teclov      11
37    Geekshub      13
35      Teclov      13
33      Teclov      14
27       Abhay      12

sorting by particular column

In [38]:
df.sort_values(by='random', ascending=False)

          name  random
temp
51      Teclov      14
33      Teclov      14
85    Geekshub      14
80       Ankit      13
37    Geekshub      13
61    Geekshub      13
35      Teclov      13
27       Abhay      12
89    Geekshub      12
59    Geekshub      12
71    Geekshub      12
42    Geekshub      11
76       Ankit      11
97       Abhay      11
39      Teclov      11
65       Abhay      10
95      Teclov      10
63       Ankit      10
64       Abhay      10
86       Abhay      10

Drop column in  DF

In [39]:
df.drop('random',axis=1)

          name
temp
51      Teclov
97       Abhay
80       Ankit
89    Geekshub
33      Teclov
37    Geekshub
42    Geekshub
76       Ankit
61    Geekshub
64       Abhay
95      Teclov
35      Teclov
85    Geekshub
59    Geekshub
39      Teclov
71    Geekshub
63       Ankit
27       Abhay
65       Abhay
86       Abhay

Iloc function in pandas library

In [41]:
df.iloc[[0,1]]

        name  random
temp
51    Teclov      14
97     Abhay      11

In [48]:
df.iloc[1:3,1]

temp
97    11
80    13
Name: random, dtype: int32

In [54]:
# df.iloc[[True,True,False,True]]

In [57]:
df.iloc[0,:]

name      Teclov
random        14
Name: 51, dtype: object

In [59]:
df.loc[[51,97,80]]

        name  random
temp
51    Teclov      14
97     Abhay      11
80     Ankit      13

In [60]:
df.loc[[51,97],'name':'random']

        name  random
temp
51    Teclov      14
97     Abhay      11

In [63]:
df.loc[df.random>13]

          name  random
temp
51      Teclov      14
33      Teclov      14
85    Geekshub      14

In [64]:
df.loc[(df.random>13) | (df.random==10)]

          name  random
temp
51      Teclov      14
33      Teclov      14
64       Abhay      10
95      Teclov      10
85    Geekshub      14
63       Ankit      10
65       Abhay      10
86       Abhay      10

Read data from CSV file

In [66]:
df1=pd.read_csv('weather_data.csv')

In [67]:
df1

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

Pip3 install openpyxl

In [71]:
# pip install openpyxl

Collecting openpyxlNote: you may need to restart the kernel to use updated packages.
  Downloading https://files.pythonhosted.org/packages/7b/60/9afac4fd6feee0ac09339de4101ee452ea643d26e9ce44c7708a0023f503/openpyxl-3.0.10-py2.py3-none-any.whl (242kB)
Collecting et-xmlfile (from openpyxl)
  Downloading https://files.pythonhosted.org/packages/96/c2/3dd434b0108730014f1b96fd286040dc3bcb70066346f7e01ec2ac95865f/et_xmlfile-1.1.0-py3-none-any.whl
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.10

You are using pip version 18.1, however version 21.3.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

Covert Csv file into excel file

In [74]:
df1.to_excel('df_xl.xlsx',  sheet_name='weather_data')

pip  install xlrd

In [75]:
# pip install xlrd

Collecting xlrdNote: you may need to restart the kernel to use updated packages.
  Downloading https://files.pythonhosted.org/packages/a6/0c/c2a72d51fe56e08a08acc85d13013558a2d793028ae7385448a6ccdfae64/xlrd-2.0.1-py2.py3-none-any.whl (96kB)
Installing collected packages: xlrd
Successfully installed xlrd-2.0.1

You are using pip version 18.1, however version 21.3.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [80]:
# import xlrd

Read excel file

In [88]:
df3=pd.read_excel('df_xl.xlsx',engine='openpyxl')

In [89]:
df3

   Unnamed: 0       day  temperature  windspeed  event
0           0  1/1/2017           32          6   Rain
1           1  1/2/2017           35          7  Sunny
2           2  1/3/2017           28          2   Snow
3           3  1/4/2017           24          7   Snow
4           4  1/5/2017           32          4   Rain
5           5  1/6/2017           31          2  Sunny

Convert excel into csv file

In [90]:
df3.to_csv('file.csv')

Removed index in file

In [91]:
df3.to_csv('file_noindex.csv', index=False)

Group be

In [99]:
df_group=df3.groupby('event')

In [106]:
df_group

In [113]:
for temperature in df_group:
    print(temperature)

('Rain',    Unnamed: 0       day  temperature  windspeed event
0           0  1/1/2017           32          6  Rain
4           4  1/5/2017           32          4  Rain)
('Snow',    Unnamed: 0       day  temperature  windspeed event
2           2  1/3/2017           28          2  Snow
3           3  1/4/2017           24          7  Snow)
('Sunny',    Unnamed: 0       day  temperature  windspeed  event
1           1  1/2/2017           35          7  Sunny
5           5  1/6/2017           31          2  Sunny)

In [121]:
df_group.get_group('Rain')

   Unnamed: 0       day  temperature  windspeed event
0           0  1/1/2017           32          6  Rain
4           4  1/5/2017           32          4  Rain

In [128]:
df_group.describe()

      Unnamed: 0                                           temperature        \
           count mean       std  min   25%  50%   75%  max       count  mean
event
Rain         2.0  2.0  2.828427  0.0  1.00  2.0  3.00  4.0         2.0  32.0
Snow         2.0  2.5  0.707107  2.0  2.25  2.5  2.75  3.0         2.0  26.0
Sunny        2.0  3.0  2.828427  1.0  2.00  3.0  4.00  5.0         2.0  33.0

       ...             windspeed
       ...   75%   max     count mean       std  min   25%  50%   75%  max
event  ...
Rain   ...  32.0  32.0       2.0  5.0  1.414214  4.0  4.50  5.0  5.50  6.0
Snow   ...  27.0  28.0       2.0  4.5  3.535534  2.0  3.25  4.5  5.75  7.0
Sunny  ...  34.0  35.0       2.0  4.5  3.535534  2.0  3.25  4.5  5.75  7.0

[3 rows x 24 columns]

In [143]:
def hot_temp(x):
    return x> 30

In [144]:
df3['hot_temp']=df3['temperature'].apply(hot_temp)

In [151]:
df3

   Unnamed: 0       day  temperature  windspeed  event  hot_temp
0           0  1/1/2017           32          6   Rain      True
1           1  1/2/2017           35          7  Sunny      True
2           2  1/3/2017           28          2   Snow     False
3           3  1/4/2017           24          7   Snow     False
4           4  1/5/2017           32          4   Rain      True
5           5  1/6/2017           31          2  Sunny      True

In [158]:
df3['hot_temp']=df3['temperature'].apply(lambda x:x>30)

In [165]:
df3

   Unnamed: 0       day  temperature  windspeed  event  hot_temp
0           0  1/1/2017           32          6   Rain      True
1           1  1/2/2017           35          7  Sunny      True
2           2  1/3/2017           28          2   Snow     False
3           3  1/4/2017           24          7   Snow     False
4           4  1/5/2017           32          4   Rain      True
5           5  1/6/2017           31          2  Sunny      True

Pivot table

In [183]:
df3.pivot_table(values='temperature',index='event',aggfunc='mean')

       temperature
event
Rain            32
Snow            26
Sunny           33

In [198]:
df3.pivot_table(columns='temperature')

temperature     24     28    31    32    35
Unnamed: 0       3      2     5     2     1
hot_temp     False  False  True  True  True
windspeed        7      2     2     5     7

In [229]:
help(pd.DataFrame.pivot_table)

Help on function pivot_table in module pandas.core.frame:

pivot_table(self, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False) -> 'DataFrame'
    Create a spreadsheet-style pivot table as a DataFrame.

    The levels in the pivot table will be stored in MultiIndex objects
    (hierarchical indexes) on the index and columns of the result DataFrame.

    Parameters
    ----------
    values : column to aggregate, optional
    index : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table index.  If an array is passed,
        it is being used as the same manner as column values.
    columns : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table column.  If an array is passed,
        it is being used as the same manner as column values.
    aggfunc : function, list of functions, dict, default numpy.mean
        If list of functions passed, the resulting pivot table will have
        hierarchical columns whose top level are the function names
        (inferred from the function objects themselves)
        If dict is passed, the key is column to aggregate and value
        is function or list of functions.
    fill_value : scalar, default None
        Value to replace missing values with (in the resulting pivot table,
        after aggregation).
    margins : bool, default False
        Add all row / columns (e.g. for subtotal / grand totals).
    dropna : bool, default True
        Do not include columns whose entries are all NaN.
    margins_name : str, default 'All'
        Name of the row / column that will contain the totals
        when margins is True.
    observed : bool, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.

        .. versionchanged:: 0.25.0

    Returns
    -------
    DataFrame
        An Excel style pivot table.

    See Also
    --------
    DataFrame.pivot : Pivot without aggregation that can handle
        non-numeric data.

    Examples
    --------
    >>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
    ...                          "bar", "bar", "bar", "bar"],
    ...                    "B": ["one", "one", "one", "two", "two",
    ...                          "one", "one", "two", "two"],
    ...                    "C": ["small", "large", "large", "small",
    ...                          "small", "large", "small", "small",
    ...                          "large"],
    ...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
    ...                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
    >>> df
         A    B      C  D  E
    0  foo  one  small  1  2
    1  foo  one  large  2  4
    2  foo  one  large  2  5
    3  foo  two  small  3  5
    4  foo  two  small  3  6
    5  bar  one  large  4  6
    6  bar  one  small  5  8
    7  bar  two  small  6  9
    8  bar  two  large  7  9

    This first example aggregates values by taking the sum.

    >>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum)
    >>> table
    C        large  small
    A   B
    bar one    4.0    5.0
        two    7.0    6.0
    foo one    4.0    1.0
        two    NaN    6.0

    We can also fill missing values using the `fill_value` parameter.

    >>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum, fill_value=0)
    >>> table
    C        large  small
    A   B
    bar one      4      5
        two      7      6
    foo one      4      1
        two      0      6

    The next example aggregates by taking the mean across multiple columns.

    >>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
    ...                     aggfunc={'D': np.mean,
    ...                              'E': np.mean})
    >>> table
                    D         E
    A   C
    bar large  5.500000  7.500000
        small  5.500000  8.500000
    foo large  2.000000  4.500000
        small  2.333333  4.333333

    We can also calculate multiple types of aggregations for any given
    value column.

    >>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
    ...                     aggfunc={'D': np.mean,
    ...                              'E': [min, max, np.mean]})
    >>> table
                    D    E
                mean  max      mean  min
    A   C
    bar large  5.500000  9.0  7.500000  6.0
        small  5.500000  9.0  8.500000  8.0
    foo large  2.000000  5.0  4.500000  4.0
        small  2.333333  6.0  4.333333  2.0

Marge two dataframe

In [230]:
d1=pd.DataFrame([['a',1],['b',2]], columns=['col1','number'])
d2=pd.DataFrame([['c',3,'lion'],['d',4,'tiger']], columns=['letter','number','animal'])

In [231]:
d1

  col1  number
0    a       1
1    b       2

In [232]:
d2

  letter  number animal
0      c       3   lion
1      d       4  tiger

In [233]:
pd.concat([d1,d2],axis=0)

  col1  number letter animal
0    a       1    NaN    NaN
1    b       2    NaN    NaN
0  NaN       3      c   lion
1  NaN       4      d  tiger

In [234]:
pd.concat([d1,d2],axis=0, ignore_index=True)

  col1  number letter animal
0    a       1    NaN    NaN
1    b       2    NaN    NaN
2  NaN       3      c   lion
3  NaN       4      d  tiger

In [235]:
pd.concat([d1,d2],axis=1)

  col1  number letter  number animal
0    a       1      c       3   lion
1    b       2      d       4  tiger

Creating DataFrame using dictionary

In [236]:
d1=pd.DataFrame({
    "city":['Lucknow','Kanpur','Agra','Delhi'],
    'temperature':[32,45,30,40]
})

In [237]:
d1

      city  temperature
0  Lucknow           32
1   Kanpur           45
2     Agra           30
3    Delhi           40

In [238]:
d2=pd.DataFrame({
    "city":['Delhi','Lucknow','Kanpur'],
    'temperature':[68,65,75]
})

In [239]:
d2

      city  temperature
0    Delhi           68
1  Lucknow           65
2   Kanpur           75

Marge them based some keys

In [240]:
df=pd.merge(d1,d2, on='city')

In [241]:
df

      city  temperature_x  temperature_y
0  Lucknow             32             65
1   Kanpur             45             75
2    Delhi             40             68

In [242]:
pd.merge(d1,d2,on=['city'],how='outer')

      city  temperature_x  temperature_y
0  Lucknow             32           65.0
1   Kanpur             45           75.0
2     Agra             30            NaN
3    Delhi             40           68.0

In [243]:
pd.merge(d1,d2,on=['city'],how='left')

      city  temperature_x  temperature_y
0  Lucknow             32           65.0
1   Kanpur             45           75.0
2     Agra             30            NaN
3    Delhi             40           68.0